In [1]:
import numpy as np
import pandas as pd

In [18]:
data=pd.read_csv("/content/House Price Prediction.csv")

data.head()

      price  area  bedrooms  ...  parking  prefarea furnishingstatus
0  13300000  7420         4  ...        2       yes        furnished
1  12250000  8960         4  ...        3        no        furnished
2  12250000  9960         3  ...        2       yes   semi-furnished
3  12215000  7500         4  ...        3       yes        furnished
4  11410000  7420         4  ...        2        no        furnished

[5 rows x 13 columns]

ONE HOT ENCODING

In [19]:
data['mainroad']=data['mainroad'].apply({'yes':1,'no':0}.get)
data['guestroom']=data['guestroom'].apply({'yes':1,'no':0}.get)
data['basement']=data['basement'].apply({'yes':1,'no':0}.get)
data['hotwaterheating']=data['hotwaterheating'].apply({'yes':1,'no':0}.get)
data['airconditioning']=data['airconditioning'].apply({'yes':1,'no':0}.get)
data['prefarea']=data['prefarea'].apply({'yes':1,'no':0}.get)
data['furnishingstatus']=data['furnishingstatus'].apply({'furnished':1,'semi-furnished':2,'unfurnished':3}.get)

In [20]:
data.head()

      price  area  bedrooms  ...  parking  prefarea  furnishingstatus
0  13300000  7420         4  ...        2         1                 1
1  12250000  8960         4  ...        3         0                 1
2  12250000  9960         3  ...        2         1                 2
3  12215000  7500         4  ...        3         1                 1
4  11410000  7420         4  ...        2         0                 1

[5 rows x 13 columns]

DIVIDING THE DATA INTO DEPENDENT AND INDEPENDENT COLUMN

In [21]:
x=data[['area','bedrooms','bathrooms','stories','mainroad','guestroom','basement','hotwaterheating','airconditioning','parking','prefarea','furnishingstatus']]
y=data['price']

In [22]:
x.head()

   area  bedrooms  bathrooms  ...  parking  prefarea  furnishingstatus
0  7420         4          2  ...        2         1                 1
1  8960         4          4  ...        3         0                 1
2  9960         3          2  ...        2         1                 2
3  7500         4          2  ...        3         1                 1
4  7420         4          1  ...        2         0                 1

[5 rows x 12 columns]

In [23]:
y.head()

0    13300000
1    12250000
2    12250000
3    12215000
4    11410000
Name: price, dtype: int64

SPLITTING THE DATA INTO TRAINING SET AND TESTING SET

In [24]:
from sklearn.model_selection import train_test_split

x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2)

MODEL BUILDING USING LINEAR REGRESSION

In [25]:
from sklearn.linear_model import LinearRegression

model=LinearRegression()

model.fit(x_train,y_train)

predictions=model.predict(x_test)

In [26]:
predictions[0:5]

array([2078739.17605608, 5059869.80488216, 7424916.87456249,
       4030627.39617834, 6698564.3998842 ])

ACCURACY OF PREDICTION

In [27]:
model.score(x,y)

0.6789908455818068

PREDICTION ON NEW DATA

In [28]:
data.head()

      price  area  bedrooms  ...  parking  prefarea  furnishingstatus
0  13300000  7420         4  ...        2         1                 1
1  12250000  8960         4  ...        3         0                 1
2  12250000  9960         3  ...        2         1                 2
3  12215000  7500         4  ...        3         1                 1
4  11410000  7420         4  ...        2         0                 1

[5 rows x 13 columns]

In [29]:
data_new={'area':8000,'bedrooms':3,'bathrooms':2,'stories':3,'mainroad':1,'guestroom':1,'basement':1,'hotwaterheating':0,'airconditioning':1,'parking':2,'prefarea':1,'furnishingstatus':2}
index=[1]
new_customer_data=pd.DataFrame(data_new,index)

new_customer_data

   area  bedrooms  bathrooms  ...  parking  prefarea  furnishingstatus
1  8000         3          2  ...        2         1                 2

[1 rows x 12 columns]

In [31]:
prediction_new=model.predict(new_customer_data)

print("HOUSE PRICE PREDICTION FOR NEW DATA IS ", prediction_new)

HOUSE PRICE PREDICTION FOR NEW DATA IS  [8479343.06184394]